Repository: bitterdev/entity_designer
Catalog: languages/*/LC_MESSAGES/messages.po
Languages: de_de

source: Create Doctrine-Entities easily in your concrete5 Dashboard. The code for entity, controller, detail view and list view is generated automatically.
de_de: Erstellen Sie Doctrine-Entities spielend einfach in Ihrem concrete5 Dashboard. Der Code für Entity, Controller, Detailansicht, sowie Listenansicht wird automatisch generiert.

source: The directory "%s" needs to be writable.
de_de: Das Verzeichnis „%s“ muss schreibbar sind.

source: Access Entity Designer
de_de: Zugriff auf Entity-Designer

source: Insert Rows
de_de: Zeile einfügen

source: Add Packages
de_de: Paket hinzufügen

source: General settings
de_de: Allgemeine Einstellungen

source: Enter a name for the entity you want to create. While typing in the name the handle field will be automatically filled too.
de_de: Bitte geben Sie einen Namen für die Entität ein die Sie erstellen wollen. Während Sie den Namen ausfüllen wird der Bezeichnet automatisch mitausgefüllt.

source: Required
de_de: Benötigt

source: Handle
de_de: Bezeichner

source: The handle must begin with a letter of the alphabet. After the first initial letter the handle can contain a underscore and letters.
de_de: Das Handle muss mit einem Buchstaben des Alphabets beginnen. Nach dem ersten Anfangsbuchstaben kann das Handle einen Unterstrich und weitere Buchstaben enthalten.

source: Package
de_de: Paket

source: If you want to create the entity within a package you can selected the destination package here.
de_de: Wenn Sie die Entität innerhalb eines Pakets erstellen möchten, können Sie das Zielpaket hier auswählen.

source: Create Package
de_de: Erstelle Paket

source: If you want to generate the entity within a package please be aware that the install code for this entity will be injected in the package controller. In this process the code formatting of the package controller get lost.
de_de: Wenn Sie die Entität innerhalb eines Pakets generieren möchten, beachten Sie bitte, dass der Installationscode für diese Entität in den Paketcontroller eingefügt wird. Dabei geht die Codeformatierung des Paketcontrollers verloren.

source: Parent Page
de_de: Elternseite

source: Select the parent page for this entity.
de_de: Wählen Sie eine Elternseite für die Entität.

source: Display Value
de_de: Wert anzeigen

source: Here you can define the display value for the entity. This value will be used when this entity is associated with another entity as identification string. You can use all text or number fields of the entity by auto complete mixed with custom content.
de_de: Hier können Sie den Anzeigewert für die Entität definieren. Dieser Wert wird als Identifikationszeichenfolge verwendet, wenn diese Entität einer anderen Entität zugeordnet ist. Sie können alle Text- oder Zahlenfelder der Entität verwenden, indem Sie via Autovervollständigung die Feldnamen eintragen gemischt mit eigenem Inhalt.

source: List View
de_de: Listenansicht

source: Help text
de_de: Hilfstext

source: Here you can enter a help text for the entire view. The help text will be shown in a blue box in the page header.
de_de: Hier können Sie den Hilfstext für die gesamte Ansicht festlegen. Der Hilfstext wird im Kopfbereich in einer blauen Box angezeigt.

source: Detail View
de_de: Detailansicht

source: Fields
de_de: Felder

source: Click the »Add Field« button in the header to start creating fields.
de_de: Klicken Sie auf »Feld hinzufügen« im Kopfbereich um Felder hinzufügen.

source: Label
de_de: Bezeichnung

source: Edit field
de_de: Feld bearbeiten

source: Remove field
de_de: Feld entfernen

source: Back
de_de: Zurück

source: Save
de_de: Speichern

source: If you confirm this dialog all files and the database schema will be regenerated and all manual code changes within the generated files get lost. Furthermore all generated blocks from this entity that are added in the frontend of the site will be removed and the current database schema including data will be removed. Are you sure that you want to proceed?
de_de: Wenn Sie dieses Dialogfeld bestätigen, werden alle Dateien und das Datenbankschema neu generiert, und alle manuellen Codeänderungen innerhalb der generierten Dateien gehen verloren. Darüber hinaus werden alle generierten Blöcke dieser Entität die im Frontend der Seite hinzugefügt wurden entfernt und das aktuelle Datenbankschema einschließlich aller Daten werden ebenfalls entfernt. Möchten Sie wirklich fortfahren?

source: Confirm
de_de: Bestätigen

source: Edit Field
de_de: Feld bearbeiten

source: Are you sure?
de_de: Sind Sie sicher?

source: Add Field
de_de: Feld hinzufügen

source: Currently there are no entities. Click the »Add Entity« button in the header to create one.
de_de: Aktuell gibt es noch keine Entitäten. Klicken Sie auf die Schaltfläche »Entität hinzufügen« im Kopfbereich um eine Entität hinzuzufügen.

source: Edit
de_de: Bearbeiten

source: Remove
de_de: Entfernen

source: Did you know?
de_de: Sind Sie sicher?

source: here
de_de: hier

source: I have many other add-ons to power up your site. Maybe the following add-on sounds interesting to you? If you want to see a full list with all of my add-ons, please click %s. As an existing customer you will get 10%% discount on your next purchase.
de_de: Ich habe viele andere Erweiterungen um Ihre Seite zu verbessern. Vielleicht klingt die folgende Erweiterung interessant für Sie? Wenn Sie eine vollständige Liste mit all meinen Erweiterungen ansehen möchten, klicken Sie bitte auf %s. Als bestehender Kunde erhalten Sie 10 %% Rabatt auf Ihren nächsten Einkauf.

source: Click %s to hide.
de_de: Klicken Sie %s zum verstecken.

source: If you need support please click %s.
de_de: Wenn Sie Support benötigen klicken Sie %s.

source: Thank You for purchasing this add-on!
de_de: Vielen Dank für den Kauf dieser Erweiterung!

source: Follow me on Twitter and Facebook to get the latest news and notifications about updates, new add-ons/themes and special offers.
de_de: Folgen Sie mir auf Twitter und Facebook um Neuigkeiten zu erhalten über Updates, neue Erweiterungen, Themes und Sonderangebote.

source: Follow @fabian_bitter
de_de: Folge @fabian_bitter

source: You have not connected your site to the Marketplace. To benefit from updates, connect your site to the Marketplace and assign the purchased licenses.
de_de: Sie haben Ihre Seite nicht mit dem Marketplace verbunden. Um von Updates profitieren zu können, verbinden Sie Ihre Seite mit dem Marketplace und weisen Sie die gekaufte Lizenz zu.

source: Rate this add-on on concrete5.org and as a thank-you gift you can choose another add-on of mine up to $35. This offer may only be claimed once. Click %s to rate now.
de_de: Bewerten Sie diese Erweiterung auf concrete5.org und als Dankeschön dürfen Sie sich eine weitere Erweiterungen von mir im Wert von $35 raussuchen. Dieses Angebot darf nur einmal beansprucht werden. Klicken Sie %s um jetzt eine Bewertung abzugeben.

source: ** None
de_de: ** Keine

source: You need to enter a name.
de_de: Sie müssen einen Namen angeben.

source: You need to enter a handle.
de_de: Bitte geben Sie einen Bezeichner ein.

source: You need to enter a display value.
de_de: Sie müssen einen Anzeigewert eingeben.

source: You need to select a parent page.
de_de: Sie müssen eine Elternseite auswählen.

source: The given handle is already in use.
de_de: The angegeben Bezeichner ist bereits in Verwendung.

source: You need to create at least one field.
de_de: Sie müssen mindestens ein Feld erstellen.

source: At least one field needs to be displayed in the list view.
de_de: Mindestens ein Feld muss in der Listenansicht angezeigt werden.

source: All associated entities needs to be in the same directory.
de_de: Alle zugeordneten Entitäten müssen sich im selben Verzeichnis befinden.

source: This entity must be in the same directory like all entities that are associated with this entity.
de_de: Diese Entität muss sich im selben Verzeichnis wie alle Entitäten befinden, die dieser Entität zugeordnet sind.

source: The entity has been successfully removed.
de_de: Die Entität wurde erfolgreich entfernt.

source: The entity has been successfully updated.
de_de: Die Entität wurde erfolgreich aktualisiert.

source: Add Entity
de_de: Entität hinzufügen

source: You need to enter a description.
de_de: Sie müssen eine Beschreibung eingeben.

source: Package created successfully.
de_de: Paket erfolgreich erstellt.

source: File
de_de: Datei

source: Page
de_de: Seite

source: Telephone
de_de: Telefon

source: Password
de_de: Passwort

source: Web address
de_de: Webadresse

source: Textarea
de_de: Textbereich

source: Number
de_de: Nummer

source: Checkbox list
de_de: Checkbox Liste

source: Select box
de_de: Auswahlliste

source: Association
de_de: Verbindung

source: All
de_de: Alle

source: Documents
de_de: Dokumente

source: One to one (1:1)
de_de: Eine zu Eine (1:1)

source: One to many (1:n)
de_de: Eine zu Viele (1:n)

source: Many to many (n:m)
de_de: Viele zu Viele (n:m)

source: Select from Sitemap
de_de: Aus Sitemap auswählen

source: Select Page
de_de: Seite auswählen

source: Quick Select
de_de: Schnellauswahl

source: You need to enter a label.
de_de: Sie müssen einen Bezeichner eingeben.

source: You need to select a valid type.
de_de: Sie müssen einen gültigen Typ auswählen.

source: You need to select a valid validation method.
de_de: Sie müssen eine gültige Validierungsmethode auswählen.

source: You need to select a valid file type.
de_de: Sie müssen einen gültigen Dateityp auswählen.

source: You need to select a page selector style.
de_de: Sie müssen einen Seitenauswahlstil auswählen.

source: You need to select a associated entity.
de_de: Sie müssen eine zugeordnete Entität auswählen.

source: You need to select a valid association type.
de_de: Sie müssen einen gültigen Zuordnungstyp auswählen.

source: This entity already contains an association with the selected target entity.
de_de: Diese Entität enthält bereits eine Zuordnung zur ausgewählten Zielentität.

source: You need to add one option at least.
de_de: Sie müssen mindestens eine Option hinzufügen.

source: You need to enter a option value.
de_de: Sie müssen einen Optionswert eingeben.

source: You need to enter a option label.
de_de: Sie müssen eine Optionsbezeichnung eingeben.

source: Field updated successfully.
de_de: Feld wurde erfolgreich aktualisiert.

source: Enter a name for the package you want to create. While typing in the name the handle field will be automatically filled too.
de_de: Geben Sie einen Namen für das Paket ein, das Sie erstellen möchten. Bei der Eingabe des Namens wird auch das Handlefeld automatisch ausgefüllt.

source: Description
de_de: Beschreibung

source: Enter a short description for the package.
de_de: Geben Sie eine kurze Beschreibung für das Paket ein.

source: Cancel
de_de: Abbrechen

source: Remove option
de_de: Entferne Option

source: Type
de_de: Typ

source: Select the type of the field. Depending on the field type you can define further type associated fields.
de_de: Wählen Sie den Typ des Felds aus. Je nach Feldtyp können Sie weitere typbezogene Felder definieren.

source: Enter a label for the field you want to create. While typing in the label the handle field will be automatically filled too.
de_de: Geben Sie eine Beschriftung für das Feld ein, dass Sie erstellen möchten. Bei der Eingabe der Beschriftung wird auch das Bezeichner-Feld automatisch ausgefüllt.

source: Prefix
de_de: Präfix

source: Enter a value to prepend a info text to the input field. Check the input field below to see this setting it in action.
de_de: Geben Sie einen Wert ein, um dem Eingabefeld einen Infotext voranzustellen. Sehen Sie das Eingabefeld unten, um diese Einstellung in Aktion zu sehen.

source: Example Prefix
de_de: Beispielpräfix

source: Enter a value to append a info text to the input field. Check the input field below to see this setting in action.
de_de: Geben Sie einen Wert ein, um einen Infotext an das Eingabefeld anzuhängen. Sehen Sie das Eingabefeld unten, um diese Einstellung in Aktion zu sehen.

source: Example Suffix
de_de: Beispiel Suffix

source: Enter a value to append a help text like this to the input field.
de_de: Geben Sie einen Wert ein, um einen Hilfetext wie diesen an das Eingabefeld anzuhängen.

source: Default Value
de_de: Standardwert

source: Enter a default value if you want to pretend a value for the field.
de_de: Geben Sie einen Standardwert ein, wenn Sie einen Wert für das Feld vorgeben möchten.

source: Placeholder
de_de: Platzhalter

source: Enter a placeholder for the field.
de_de: Geben Sie einen Platzhalter für das Feld ein.

source: Maximum length
de_de: Maximale Länge

source: Define the maximum length for the field.
de_de: Definieren Sie die maximale Länge für das Feld.

source: Minimum value
de_de: Minimalwert

source: Define the minimum value for the field.
de_de: Definieren Sie den Mindestwert für das Feld.

source: Maximum value
de_de: Maximalwert

source: Define the maximum value for the field.
de_de: Definieren Sie den Maximalwert für das Feld.

source: Step size
de_de: Schrittgröße

source: Define the step size for the field.
de_de: Definieren Sie die Schrittgröße für das Feld.

source: Validation
de_de: Validierung

source: If you want validation for the field can select the type of validation here.
de_de: Wenn Sie eine Validierung für das Feld wünschen, können Sie hier den Validierungstyp auswählen.

source: Allowed File Type
de_de: Zulässiger Dateityp

source: If you want to filter certain file types in the dialog you can select the allowed file types here.
de_de: Wenn Sie bestimmte Dateitypen im Dialogfeld filtern möchten, können Sie hier die zulässigen Dateitypen auswählen.

source: Style
de_de: Stil

source: Please choose the style of the select page dialog.
de_de: Wählen Sie den Stil des Dialogfelds "Ausgewählte Seite".

source: Associated Entity
de_de: Assoziierte Entität

source: Please select the destination entity for the association.
de_de: Wählen Sie die Zielentität für die Zuordnung aus.

source: Association Type
de_de: Assoziationstyp

source: Please select the type of the association.
de_de: Bitte wählen Sie den Typ der Zuordnung aus.

source: Options
de_de: Optionen

source: Click the »Add Option« button to start creating fields.
de_de: Klicken Sie auf die Schaltfläche »Option hinzufügen", um mit dem Erstellen von Feldern zu beginnen.

source: Value
de_de: Wert

source: Add Option
de_de: Option hinzufügen

source: Display field in list view.
de_de: Feld in der Listenansicht anzeigen.

source: Invalid type supplied to validator.
de_de: Ungültiger Typ, der dem Validator angegeben wird.

source: The given handle is not valid.
de_de: Das angegebene Handle ist ungültig.

source: Add
de_de: Hinzufügen

source: This file was build with the Entity Designer add-on.
de_de: Diese Datei wurde mit der Entity Designer Erweiterung erstellt.
